In [1]:
import pandas as pd

In [4]:
#from the previous pandas file we know that if we want to import a tanle with comma  seperated:
ufo = pd.read_table('http://bit.ly/uforeports' , sep= ',')
ufo

,City,Colors Reported,Shape Reported,State,Time
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00
3,Abilene,NaN,DISK,KS,6/1/1931 13:00
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00
...,...,...,...,...,...
18236,Grant Park,NaN,TRIANGLE,IL,12/31/2000 23:00
18237,Spirit Lake,NaN,DISK,IA,12/31/2000 23:00
18238,Eagle River,NaN,NaN,WI,12/31/2000 23:45
18239,Eagle River,RED,LIGHT,WI,12/31/2000 23:45
18240,Ybor,NaN,OVAL,FL,12/31/2000 23:59

In [21]:
#another way to imporrt a table that is comma seperated
ufo = pd.read_csv('http://bit.ly/uforeports' )
ufo

,City,Colors Reported,Shape Reported,State,Time
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00
3,Abilene,NaN,DISK,KS,6/1/1931 13:00
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00
...,...,...,...,...,...
18236,Grant Park,NaN,TRIANGLE,IL,12/31/2000 23:00
18237,Spirit Lake,NaN,DISK,IA,12/31/2000 23:00
18238,Eagle River,NaN,NaN,WI,12/31/2000 23:45
18239,Eagle River,RED,LIGHT,WI,12/31/2000 23:45
18240,Ybor,NaN,OVAL,FL,12/31/2000 23:59

In [5]:
#the type of ufo
print(type(ufo))
#it is a DataFrame!

<class 'pandas.core.frame.DataFrame'>

In [8]:
#the basic way to select a series 
#NOTE :it is case sensetive
#for example if we want to check what is the type of city column
print(type(ufo.City))

<class 'pandas.core.series.Series'>

In [10]:
print(type('City'))
#you can see the difference with or without ufo

<class 'str'>

In [11]:
#now we want to select city series
#first way
ufo['City']

0                      Ithaca
1                 Willingboro
2                     Holyoke
3                     Abilene
4        New York Worlds Fair
                 ...
18236              Grant Park
18237             Spirit Lake
18238             Eagle River
18239             Eagle River
18240                    Ybor
Name: City, Length: 18241, dtype: object

In [12]:
#dot notation
ufo.City

0                      Ithaca
1                 Willingboro
2                     Holyoke
3                     Abilene
4        New York Worlds Fair
                 ...
18236              Grant Park
18237             Spirit Lake
18238             Eagle River
18239             Eagle River
18240                    Ybor
Name: City, Length: 18241, dtype: object

In [14]:
#if the column name is spaced like(color reported) --> dot notation simply will not work 
#you have to use bracket notation
ufo.Colors Reported
#It resulted in an error

SyntaxError: invalid syntax (3277378713.py, line 3)

In [15]:
#instead we use brackets
ufo['Colors Reported']

0        NaN
1        NaN
2        NaN
3        NaN
4        NaN
        ...
18236    NaN
18237    NaN
18238    NaN
18239    RED
18240    NaN
Name: Colors Reported, Length: 18241, dtype: object

In [16]:
#dot notation will not work if the columnn name is the same as built in attribute
#like --> ufo.shape
#it means that if your column name is the same as a built in function and you are tying to select it with dot 
#notation it will NOT work
ufo.shape

(18241, 5)

In [17]:
#how to creat a new series in a dataframe from two exiting series
ufo.Location = ufo.City + ' , ' +ufo.State

/var/folders/1g/c9ls9g7958sc__33l6tsmst80000gn/T/ipykernel_19245/79143006.py:2: UserWarning: Pandas doesn't allow columns to be created via a new attribute name - see https://pandas.pydata.org/pandas-docs/stable/indexing.html#attribute-access
  ufo.Location = ufo.City + ' , ' +ufo.State

In [18]:
#the correct way
ufo['Location'] = ufo.City + ' , ' +ufo.State

In [19]:
ufo.head()
#it worked :)

,City,Colors Reported,Shape Reported,State,Time,Location
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00,"Ithaca , NY"
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00,"Willingboro , NJ"
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00,"Holyoke , CO"
3,Abilene,NaN,DISK,KS,6/1/1931 13:00,"Abilene , KS"
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00,"New York Worlds Fair , NY"

In [ ]:
#why do some pandas commands end with parentheses and other commands dont

In [22]:
movies = pd.read_csv('http://bit.ly/imdbratings')
movies.head()

,star_rating,title,content_rating,genre,duration,actors_list
0,9.3,The Shawshank Redemption,R,Crime,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt..."
1,9.2,The Godfather,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']"
2,9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv..."
3,9.0,The Dark Knight,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E..."
4,8.9,Pulp Fiction,R,Crime,154,"[u'John Travolta', u'Uma Thurman', u'Samuel L...."

In [23]:
movies.describe() #<-- describe of all numeric values.

       star_rating    duration
count   979.000000  979.000000
mean      7.889785  120.979571
std       0.336069   26.218010
min       7.400000   64.000000
25%       7.600000  102.000000
50%       7.800000  117.000000
75%       8.100000  134.000000
max       9.300000  242.000000

In [24]:
movies.shape #<-- rows and columns

(979, 6)

In [25]:
movies.dtypes

star_rating       float64
title              object
content_rating     object
genre              object
duration            int64
actors_list        object
dtype: object

In [ ]:
#simply dataframes has methods and attributes, methods have parentheses and attributes don't have.
#think of methods as actions and attributes description about who you are :)

In [26]:
#pandas function --> pd.read_csv() 
# methods may have arguments or not.

In [27]:
import pandas as pd
movies = pd.read_csv('http://bit.ly/imdbratings')
#but you can put arguments 
movies.describe(include=['object'])
#describe the columns with the object type

,title,content_rating,genre,actors_list
count,979,976,979,979
unique,975,12,16,969
top,Dracula,R,Drama,"[u'Daniel Radcliffe', u'Emma Watson', u'Rupert..."
freq,2,460,278,6

In [ ]:
#and voila ;)